[
  {
    "id": "evening-couture",
    "title": "Evening Couture",
    "image": "/images/Pins/00680064cb1472e22a0c6a4b49379dd5.jpg",
    "category": "Women",
    "story": "Inspired by timeless silhouettes and hand-finished detailing, our Evening Couture collection transforms the night into a stage. Each gown is cut to flow with the body, draped in silk and adorned with carefully placed embellishments that catch the light."
  },
  {
    "id": "bridal-bespoke",
    "title": "Bridal Bespoke",
    "image": "/images/Pins/01ca9087f70cccc74a2f1b6be6f52980.jpg",
    "category": "Bridal",
    "story": "Each bridal piece is sculpted uniquely for the wearer. We believe a wedding gown should feel like a second skin — an extension of your grace on the most significant day of your life. Every bride deserves a dress that tells her story."
  },
  {
    "id": "power-dressing",
    "title": "Power Dressing",
    "image": "/images/Pins/025f0a0ad31ddd5b409c217a793e0fcf.jpg",
    "category": "Women",
    "story": "For the woman who commands every room she enters. Our power dressing collection fuses structure with femininity — tailored suits, strong shoulders, and refined lines that speak before you say a word."
  },
  {
    "id": "heritage-collection",
    "title": "Heritage Collection",
    "image": "/images/Pins/0263d811571dd5bccf6c48532ea89dc4.jpg",
    "category": "Heritage",
    "story": "A celebration of Nigerian textile heritage reimagined for the contemporary world. Hand-woven Aso-oke meets modern silhouettes, creating pieces that honor the past while embracing the future."
  },
  {
    "id": "gentlemens-atelier",
    "title": "Gentleman's Atelier",
    "image": "/images/Pins/01ca6e31d85bd471e8080613d3d38162.jpg",
    "category": "Men",
    "story": "The well-dressed man is never overdressed. Our menswear line offers impeccably tailored suits, agbadas, and casual luxury pieces — each constructed to the highest standard of bespoke craftsmanship."
  },
  {
    "id": "resort-luxe",
    "title": "Resort Luxe",
    "image": "/images/short%20gown/22b44a7e1929d9b67e62772bc228429f.jpg",
    "category": "Women",
    "story": "Where effortless style meets resort sophistication. Lightweight fabrics, relaxed silhouettes, and refined detailing make these pieces perfect for the discerning traveller who refuses to compromise on elegance."
  },
  {
    "id": "ankara-edit",
    "title": "Ankara Edit",
    "image": "/images/Pins/0295dfedb581a6ec0ce1b7184d99ab84.jpg",
    "category": "Heritage",
    "story": "Bold prints, structured cuts, and undeniable confidence. The Ankara Edit channels the vibrancy of West African textile traditions into ready-to-wear silhouettes that turn heads at every occasion."
  },
  {
    "id": "cocktail-hour",
    "title": "Cocktail Hour",
    "image": "/images/Pins/0831d63dee19f79cd8a36e9d8694e257.jpg",
    "category": "Women",
    "story": "Cocktail dressing redefined. Each piece in this collection is designed to take you from the reception to the dance floor without missing a beat — polished, spirited, and entirely your own."
  },
  {
    "id": "short-gown-luxe",
    "title": "Short Gown Luxe",
    "image": "/images/short%20gown/3103ef9862211497c26205bcc1ff370a.jpg",
    "category": "Women",
    "story": "Effortlessly chic short gowns crafted for the modern woman who values both style and comfort. Each piece features exquisite detailing that elevates the everyday into the extraordinary."
  }
]
